test-requests/getEmployee.xml

<?xml version="1.0" encoding="UTF-8"?>
<!--
    SOAP 1.2 Request: getEmployee(1)

    curl -X POST http://localhost:8080/EmployeeService/EmployeeService \
         -H "Content-Type: application/soap+xml;charset=UTF-8" \
         -d @test-requests/getEmployee.xml
-->
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
               xmlns:ser="http://service.soap.enterprise.com/">
    <soap:Header/>
    <soap:Body>
        <ser:getEmployee>
            <employeeId>1</employeeId>
        </ser:getEmployee>
    </soap:Body>
</soap:Envelope>
